//==============================================================================
///
/// @file
/// @brief Программа для робота Карела и стартовая функция
///
//==============================================================================


#include "karel.h"


//==============================================================================
/// Программа для робота Карела
///
void KarelProgram() {
/// @todo Добавить программу для Карела

}


//==============================================================================
/// Стартовая функция
///
int main() {
    LoadWorld("worlds/.w");
    KarelProgram();
    Finish();
    return 0;
}
